tutorials/ShearDeform/FTShearDeformWallDMR/0.org/mu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 4000;

boundaryField
{
    inlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 4000;
    }

    outlet
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 4000;
    }
    walls
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 4000;
    }
}

// ************************************************************************* //
