tutorials/ShearDeform/FTShearDeformWallDMR/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version    9.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

// How often to refine
refineInterval  20;
// Field to be refinement on
field           cellsToRefine_;
// Refine field inbetween lower..upper
lowerRefineLevel -1.1;
upperRefineLevel -0.9;
// If value < unrefineLevel unrefine
unrefineLevel   1;//10
// Have slower than 2:1 refinement
nBufferLayers   2;
// Refine cells only up to maxRefinement levels
maxRefinement   1; //2
// Stop refinement if maxCells reached
maxCells        600000;
// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi U)
    (nHatf none)
    (rhoPhi none)
    (ghf none)
);
// Write the refinement level as a volScalarField
dumpLevel       true;


// ************************************************************************* //
