tutorials/ShearDeform/FTShearDeformWallDMR/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
		solver          GAMG;
        smoother        DIC;
        tolerance       1e-9;
        relTol          0.01;
        //maxIter         100;
		//smoother        DICGaussSeidel;
	    nPreSweeps      0;
	    nPostSweeps     2;
	    nFinestSweeps   2;
	    cacheAgglomeration true;
	    nCellsInCoarsestLevel 10;
	    agglomerator    faceAreaPair;
	    mergeLevels     1;
    }

    pcorrFinal
    {
        $pcorr;
		tolerance       1e-10;
        relTol          0;
    }

    p_rgh
    {
        $pcorr;
        tolerance       1e-07;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-08;
        relTol          0;
    }

    U
    {
        solver PBiCGStab; 
		preconditioner DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(U)Final"
    {
        $U;
		tolerance       1e-07;
        relTol          0;
    }


    indicator
    {

        solver          PCG;//ICCG,PCG
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;

        /*
        solver           GAMG;
        tolerance        1e-12;//1e-12;
        relTol           1e-12;//1e-6;

        smoother         nonBlockingGaussSeidel;

        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;
        */
    }

	"(indicator)Final"
    {
        $indicator;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;
    //pRefCell        1;
    //pRefValue       0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}
// ************************************************************************* //
